&Наклиенте;
~ Метка:
вычислить
//выведем пользователю список вариантов, 
//для ввода СФ около элемента управления «Кнопка»
Перейти ~Метка1 ;
~Метка1: Сообщить("Осуществлен переход по метке.");
попытка
Если 1Истина
Для каждого а из б цикл
прервать
продолжить

пока
для а = 1 по 5 цикл
конеццикла

a<=b;
НСтроки[НСтроки.Количество()-1];
	б = ?(-а=-1,+1,/2)%;
&НаКлиенте
#Область АБВ
#КонецОбласти
СписокДействийВводСФ = Новый СписокЗначений();
СписокДействийВводСФ.Добавить(
"ВвестиНовыйСчетФактуру", "Ввести новый счет-фактуру");
СписокДействийВводСФ.Добавить(
"ДополнитьСуществующийСчетФактуру", "Дополнить существующий счет-фактуру");

// ФормаДокумента.ТекущийЭлемент - 
//Элемент, около которого открывается список 
ВыбранныйВариантВводаСФ = ФормаДокумента.ВыбратьИзМеню(
СписокДействийВводСФ, ФормаДокумента.ТекущийЭлемент);
Если ВыбранныйВариантВводаСФ = Неопределено Тогда
	Возврат;
КонецЕсли;
		
Если ВыбранныйВариантВводаСФ.Значение = "ВвестиНовыйСчетФактуру" Тогда
    ...
КонецЕсл
